AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.3.0/mcu/apollo510/regs/am_mcu_apollo510_mraminfo1.h
//*****************************************************************************
//
//  am_mcu_apollo510_info1.h
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2025, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk5p0p0-5f68a8286b of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_INFO1_H
#define AM_REG_INFO1_H

#define AM_REG_INFO1_BASEADDR 0x42002000

#define AM_REG_INFO1_SBL_VERSION_0_O 0x00001200
#define AM_REG_INFO1_SBL_VERSION_0_ADDR 0x42003200
#define AM_REG_INFO1_SBL_VERSION_1_O 0x00001204
#define AM_REG_INFO1_SBL_VERSION_1_ADDR 0x42003204
#define AM_REG_INFO1_MAINPTR_O 0x00001210
#define AM_REG_INFO1_MAINPTR_ADDR 0x42003210
#define AM_REG_INFO1_PATCH_TRACKER0_O 0x00001240
#define AM_REG_INFO1_PATCH_TRACKER0_ADDR 0x42003240
#define AM_REG_INFO1_PATCH_TRACKER1_O 0x00001244
#define AM_REG_INFO1_PATCH_TRACKER1_ADDR 0x42003244
#define AM_REG_INFO1_PATCH_TRACKER2_O 0x00001248
#define AM_REG_INFO1_PATCH_TRACKER2_ADDR 0x42003248
#define AM_REG_INFO1_PATCH_TRACKER3_O 0x0000124c
#define AM_REG_INFO1_PATCH_TRACKER3_ADDR 0x4200324c
#define AM_REG_INFO1_SBR_SDCERT_ADDR_O 0x00001250
#define AM_REG_INFO1_SBR_SDCERT_ADDR_ADDR 0x42003250
#define AM_REG_INFO1_SBR_IPT_ADDR_O 0x00001258
#define AM_REG_INFO1_SBR_IPT_ADDR_ADDR 0x42003258
#define AM_REG_INFO1_SBR_OPT_ADDR_O 0x0000125c
#define AM_REG_INFO1_SBR_OPT_ADDR_ADDR 0x4200325c
#define AM_REG_INFO1_TRIM_SBR_OTP_O 0x00001260
#define AM_REG_INFO1_TRIM_SBR_OTP_ADDR 0x42003260
#define AM_REG_INFO1_TEMP_CAL_ATE_O 0x00001300
#define AM_REG_INFO1_TEMP_CAL_ATE_ADDR 0x42003300
#define AM_REG_INFO1_TEMP_CAL_MEASURED_O 0x00001304
#define AM_REG_INFO1_TEMP_CAL_MEASURED_ADDR 0x42003304
#define AM_REG_INFO1_TEMP_CAL_ADC_OFFSET_O 0x00001308
#define AM_REG_INFO1_TEMP_CAL_ADC_OFFSET_ADDR 0x42003308
#define AM_REG_INFO1_CHIPSUBREV_O 0x0000130c
#define AM_REG_INFO1_CHIPSUBREV_ADDR 0x4200330c
#define AM_REG_INFO1_TRIM_REV_O 0x00001310
#define AM_REG_INFO1_TRIM_REV_ADDR 0x42003310
#define AM_REG_INFO1_FT1_GDR1_O 0x00001314
#define AM_REG_INFO1_FT1_GDR1_ADDR 0x42003314
#define AM_REG_INFO1_FT2_GDR1_O 0x00001318
#define AM_REG_INFO1_FT2_GDR1_ADDR 0x42003318
#define AM_REG_INFO1_LVT_TRIMCODE_O 0x0000131c
#define AM_REG_INFO1_LVT_TRIMCODE_ADDR 0x4200331c
#define AM_REG_INFO1_EHVT_TRIMCODE_O 0x00001320
#define AM_REG_INFO1_EHVT_TRIMCODE_ADDR 0x42003320
#define AM_REG_INFO1_ADC_GAIN_ERR_O 0x00001328
#define AM_REG_INFO1_ADC_GAIN_ERR_ADDR 0x42003328
#define AM_REG_INFO1_ADC_OFFSET_ERR_O 0x0000132c
#define AM_REG_INFO1_ADC_OFFSET_ERR_ADDR 0x4200332c
#define AM_REG_INFO1_AUDADC_A0_LG_OFFSET_O 0x00001340
#define AM_REG_INFO1_AUDADC_A0_LG_OFFSET_ADDR 0x42003340
#define AM_REG_INFO1_AUDADC_A0_HG_SLOPE_O 0x00001344
#define AM_REG_INFO1_AUDADC_A0_HG_SLOPE_ADDR 0x42003344
#define AM_REG_INFO1_AUDADC_A0_HG_INTERCEPT_O 0x00001348
#define AM_REG_INFO1_AUDADC_A0_HG_INTERCEPT_ADDR 0x42003348
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_O 0x0000134c
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_ADDR 0x4200334c
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_O 0x00001350
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_ADDR 0x42003350
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_O 0x00001354
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_ADDR 0x42003354
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_O 0x00001358
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_ADDR 0x42003358
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_O 0x0000135c
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_ADDR 0x4200335c
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_O 0x00001360
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_ADDR 0x42003360
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_O 0x00001364
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_ADDR 0x42003364
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_O 0x00001368
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_ADDR 0x42003368
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_O 0x0000136c
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_ADDR 0x4200336c
#define AM_REG_INFO1_POWERSTATE0_O 0x00001370
#define AM_REG_INFO1_POWERSTATE0_ADDR 0x42003370
#define AM_REG_INFO1_POWERSTATE1_O 0x00001374
#define AM_REG_INFO1_POWERSTATE1_ADDR 0x42003374
#define AM_REG_INFO1_POWERSTATE2_O 0x00001378
#define AM_REG_INFO1_POWERSTATE2_ADDR 0x42003378
#define AM_REG_INFO1_POWERSTATE3_O 0x0000137c
#define AM_REG_INFO1_POWERSTATE3_ADDR 0x4200337c
#define AM_REG_INFO1_POWERSTATE4_O 0x00001380
#define AM_REG_INFO1_POWERSTATE4_ADDR 0x42003380
#define AM_REG_INFO1_POWERSTATE5_O 0x00001384
#define AM_REG_INFO1_POWERSTATE5_ADDR 0x42003384
#define AM_REG_INFO1_POWERSTATE6_O 0x00001388
#define AM_REG_INFO1_POWERSTATE6_ADDR 0x42003388
#define AM_REG_INFO1_POWERSTATE7_O 0x0000138c
#define AM_REG_INFO1_POWERSTATE7_ADDR 0x4200338c
#define AM_REG_INFO1_POWERSTATE8_O 0x00001390
#define AM_REG_INFO1_POWERSTATE8_ADDR 0x42003390
#define AM_REG_INFO1_POWERSTATE9_O 0x00001394
#define AM_REG_INFO1_POWERSTATE9_ADDR 0x42003394
#define AM_REG_INFO1_POWERSTATE10_O 0x00001398
#define AM_REG_INFO1_POWERSTATE10_ADDR 0x42003398
#define AM_REG_INFO1_POWERSTATE11_O 0x0000139c
#define AM_REG_INFO1_POWERSTATE11_ADDR 0x4200339c
#define AM_REG_INFO1_POWERSTATE12_O 0x000013a0
#define AM_REG_INFO1_POWERSTATE12_ADDR 0x420033a0
#define AM_REG_INFO1_POWERSTATE13_O 0x000013a4
#define AM_REG_INFO1_POWERSTATE13_ADDR 0x420033a4
#define AM_REG_INFO1_POWERSTATE14_O 0x000013a8
#define AM_REG_INFO1_POWERSTATE14_ADDR 0x420033a8
#define AM_REG_INFO1_POWERSTATE15_O 0x000013ac
#define AM_REG_INFO1_POWERSTATE15_ADDR 0x420033ac
#define AM_REG_INFO1_POWERSTATE16_O 0x000013b0
#define AM_REG_INFO1_POWERSTATE16_ADDR 0x420033b0
#define AM_REG_INFO1_POWERSTATE17_O 0x000013b4
#define AM_REG_INFO1_POWERSTATE17_ADDR 0x420033b4
#define AM_REG_INFO1_POWERSTATE18_O 0x000013b8
#define AM_REG_INFO1_POWERSTATE18_ADDR 0x420033b8
#define AM_REG_INFO1_POWERSTATE19_O 0x000013bc
#define AM_REG_INFO1_POWERSTATE19_ADDR 0x420033bc
#define AM_REG_INFO1_GPUVDDCTON_O 0x000013c0
#define AM_REG_INFO1_GPUVDDCTON_ADDR 0x420033c0
#define AM_REG_INFO1_GPUVDDFTON_O 0x000013c4
#define AM_REG_INFO1_GPUVDDFTON_ADDR 0x420033c4
#define AM_REG_INFO1_STMTON_O 0x000013c8
#define AM_REG_INFO1_STMTON_ADDR 0x420033c8
#define AM_REG_INFO1_DEFAULTTON_O 0x000013cc
#define AM_REG_INFO1_DEFAULTTON_ADDR 0x420033cc
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_O 0x000013d0
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_ADDR 0x420033d0
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_O 0x000013d4
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_ADDR 0x420033d4
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_O 0x000013d8
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_ADDR 0x420033d8
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_O 0x000013dc
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_ADDR 0x420033dc
#define AM_REG_INFO1_MEMLDOCONFIG_O 0x000013e0
#define AM_REG_INFO1_MEMLDOCONFIG_ADDR 0x420033e0

// SBL_VERSION_0 - Contains the SBL Version number encoding.
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_S 0
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_M 0xFFFFFFFF
#define AM_REG_INFO1_SBL_VERSION_0_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_Pos 0
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_Msk 0xFFFFFFFF

// SBL_VERSION_1 - Contains the SBL date code encoding.
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_S 0
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_M 0xFFFFFFFF
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_Pos 0
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_Msk 0xFFFFFFFF

// MAINPTR - The location of the vector table of the main program. This value is read-only.
#define AM_REG_INFO1_MAINPTR_ADDRESS_S 0
#define AM_REG_INFO1_MAINPTR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_MAINPTR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_MAINPTR_ADDRESS_Pos 0
#define AM_REG_INFO1_MAINPTR_ADDRESS_Msk 0xFFFFFFFF

// PATCH_TRACKER0 - Apollo510 family SBL patch tracking [31:0]
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_S 0
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_M 0xFFFFFFFF
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_Pos 0
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_Msk 0xFFFFFFFF

// PATCH_TRACKER1 - Apollo510 family SBL patch tracking [63:32]
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_S 0
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_M 0xFFFFFFFF
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_Pos 0
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_Msk 0xFFFFFFFF

// PATCH_TRACKER2 - Apollo510 family SBL patch tracking [95:64]
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_S 0
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_M 0xFFFFFFFF
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_Pos 0
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_Msk 0xFFFFFFFF

