AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.3.0/mcu/apollo510/regs/am_mcu_apollo510_mraminfo1.h
// POWERSTATE9 - Power state register. CPU HP mode, GPU off, XYZ peripherals off. Temperature range 0C to 50C.
#define AM_REG_INFO1_POWERSTATE9_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE9_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE9_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE9_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE9_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE9_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE9_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE9_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE9_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE9_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE9_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE9_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE9_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE9_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE9_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE9_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE9_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE9_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE9_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE9_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE9_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE9_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE9_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE9_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE9_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE9_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE9_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE9_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE9_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE9_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE10 - Power state register. CPU HP mode, GPU off, XYZ peripherals off. Temperature range -20C to 0C.
#define AM_REG_INFO1_POWERSTATE10_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE10_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE10_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE10_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE10_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE10_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE10_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE10_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE10_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE10_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE10_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE10_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE10_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE10_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE10_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE10_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE10_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE10_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE10_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE10_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE10_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE10_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE10_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE10_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE10_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE10_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE10_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE10_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE10_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE10_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE11 - Power state register. CPU HP mode, GPU off, XYZ peripherals off. Temperature range -40C to -20C.
#define AM_REG_INFO1_POWERSTATE11_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE11_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE11_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE11_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE11_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE11_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE11_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE11_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE11_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE11_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE11_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE11_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE11_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE11_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE11_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE11_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE11_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE11_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE11_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE11_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE11_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE11_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE11_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE11_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE11_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE11_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE11_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE11_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE11_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE11_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE12 - Power state register. CPU HP mode, GPU on and/or XYZ peripherals on. Temperature range greater than 50C.
#define AM_REG_INFO1_POWERSTATE12_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE12_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE12_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE12_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE12_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE12_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE12_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE12_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE12_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE12_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE12_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE12_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE12_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE12_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE12_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE12_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE12_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE12_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE12_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE12_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE12_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE12_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE12_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE12_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE12_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE12_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE12_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE12_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE12_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE12_TVRGFACTTRIM_Msk 0x0000007F

