AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.3.0/mcu/apollo510/regs/am_mcu_apollo510_mraminfo1.h
// POWERSTATE17 - Power state register. CPU LP mode, GPU or SDIO on, 0C to 50C.
#define AM_REG_INFO1_POWERSTATE17_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE17_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE17_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE17_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE17_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE17_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE17_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE17_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE17_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE17_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE17_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE17_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE17_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE17_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE17_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE17_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE17_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE17_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE17_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE17_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE17_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE17_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE17_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE17_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE17_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE17_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE17_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE17_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE17_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE17_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE18 - Power state register. CPU LP mode, GPU or SDIO on, -20C to 0C.
#define AM_REG_INFO1_POWERSTATE18_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE18_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE18_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE18_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE18_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE18_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE18_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE18_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE18_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE18_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE18_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE18_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE18_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE18_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE18_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE18_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE18_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE18_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE18_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE18_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE18_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE18_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE18_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE18_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE18_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE18_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE18_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE18_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE18_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE18_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE19 - Power state register. CPU LP mode, GPU or SDIO on, -40C to -20C.
#define AM_REG_INFO1_POWERSTATE19_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE19_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE19_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE19_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE19_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE19_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE19_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE19_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE19_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE19_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE19_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE19_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE19_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE19_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE19_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE19_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE19_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE19_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE19_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE19_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE19_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE19_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE19_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE19_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE19_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE19_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE19_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE19_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE19_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE19_TVRGFACTTRIM_Msk 0x0000007F

// GPUVDDCTON - GPU VDDC Ton Adjustments
#define AM_REG_INFO1_GPUVDDCTON_RESVD_S 25
#define AM_REG_INFO1_GPUVDDCTON_RESVD_M 0xFE000000
#define AM_REG_INFO1_GPUVDDCTON_RESVD(n) (((uint32_t)(n) << 25) & 0xFE000000)
#define AM_REG_INFO1_GPUVDDCTON_RESVD_Pos 25
#define AM_REG_INFO1_GPUVDDCTON_RESVD_Msk 0xFE000000
#define AM_REG_INFO1_GPUVDDCTON_PWRSTATE12VDDCTON_S 20
#define AM_REG_INFO1_GPUVDDCTON_PWRSTATE12VDDCTON_M 0x01F00000
#define AM_REG_INFO1_GPUVDDCTON_PWRSTATE12VDDCTON(n) (((uint32_t)(n) << 20) & 0x01F00000)
#define AM_REG_INFO1_GPUVDDCTON_PWRSTATE12VDDCTON_Pos 20
#define AM_REG_INFO1_GPUVDDCTON_PWRSTATE12VDDCTON_Msk 0x01F00000
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPUHPVDDCTON_S 15
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPUHPVDDCTON_M 0x000F8000
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPUHPVDDCTON(n) (((uint32_t)(n) << 15) & 0x000F8000)
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPUHPVDDCTON_Pos 15
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPUHPVDDCTON_Msk 0x000F8000
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPULPVDDCTON_S 10
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPULPVDDCTON_M 0x00007C00
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPULPVDDCTON(n) (((uint32_t)(n) << 10) & 0x00007C00)
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPULPVDDCTON_Pos 10
#define AM_REG_INFO1_GPUVDDCTON_GPUHPCPULPVDDCTON_Msk 0x00007C00
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPUHPVDDCTON_S 5
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPUHPVDDCTON_M 0x000003E0
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPUHPVDDCTON(n) (((uint32_t)(n) << 5) & 0x000003E0)
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPUHPVDDCTON_Pos 5
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPUHPVDDCTON_Msk 0x000003E0
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPULPVDDCTON_S 0
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPULPVDDCTON_M 0x0000001F
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPULPVDDCTON(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPULPVDDCTON_Pos 0
#define AM_REG_INFO1_GPUVDDCTON_GPULPCPULPVDDCTON_Msk 0x0000001F

// GPUVDDFTON - GPU VDDF Ton adjustments
#define AM_REG_INFO1_GPUVDDFTON_RESVD_S 20
#define AM_REG_INFO1_GPUVDDFTON_RESVD_M 0xFFF00000
#define AM_REG_INFO1_GPUVDDFTON_RESVD(n) (((uint32_t)(n) << 20) & 0xFFF00000)
#define AM_REG_INFO1_GPUVDDFTON_RESVD_Pos 20
#define AM_REG_INFO1_GPUVDDFTON_RESVD_Msk 0xFFF00000
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPUHPVDDFTON_S 15
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPUHPVDDFTON_M 0x000F8000
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPUHPVDDFTON(n) (((uint32_t)(n) << 15) & 0x000F8000)
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPUHPVDDFTON_Pos 15
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPUHPVDDFTON_Msk 0x000F8000
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPULPVDDFTON_S 10
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPULPVDDFTON_M 0x00007C00
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPULPVDDFTON(n) (((uint32_t)(n) << 10) & 0x00007C00)
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPULPVDDFTON_Pos 10
#define AM_REG_INFO1_GPUVDDFTON_GPUHPCPULPVDDFTON_Msk 0x00007C00
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPUHPVDDFTON_S 5
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPUHPVDDFTON_M 0x000003E0
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPUHPVDDFTON(n) (((uint32_t)(n) << 5) & 0x000003E0)
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPUHPVDDFTON_Pos 5
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPUHPVDDFTON_Msk 0x000003E0
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPULPVDDFTON_S 0
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPULPVDDFTON_M 0x0000001F
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPULPVDDFTON(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPULPVDDFTON_Pos 0
#define AM_REG_INFO1_GPUVDDFTON_GPULPCPULPVDDFTON_Msk 0x0000001F

// STMTON - STM Ton adjustments register
#define AM_REG_INFO1_STMTON_RESVD_S 25
#define AM_REG_INFO1_STMTON_RESVD_M 0xFE000000
#define AM_REG_INFO1_STMTON_RESVD(n) (((uint32_t)(n) << 25) & 0xFE000000)
#define AM_REG_INFO1_STMTON_RESVD_Pos 25
#define AM_REG_INFO1_STMTON_RESVD_Msk 0xFE000000
#define AM_REG_INFO1_STMTON_PWRSTATE8VDDCTON_S 20
#define AM_REG_INFO1_STMTON_PWRSTATE8VDDCTON_M 0x01F00000
#define AM_REG_INFO1_STMTON_PWRSTATE8VDDCTON(n) (((uint32_t)(n) << 20) & 0x01F00000)
#define AM_REG_INFO1_STMTON_PWRSTATE8VDDCTON_Pos 20
#define AM_REG_INFO1_STMTON_PWRSTATE8VDDCTON_Msk 0x01F00000
#define AM_REG_INFO1_STMTON_STMCPUHPVDDFTON_S 15
#define AM_REG_INFO1_STMTON_STMCPUHPVDDFTON_M 0x000F8000
#define AM_REG_INFO1_STMTON_STMCPUHPVDDFTON(n) (((uint32_t)(n) << 15) & 0x000F8000)
#define AM_REG_INFO1_STMTON_STMCPUHPVDDFTON_Pos 15
#define AM_REG_INFO1_STMTON_STMCPUHPVDDFTON_Msk 0x000F8000
#define AM_REG_INFO1_STMTON_STMCPULPVDDFTON_S 10
#define AM_REG_INFO1_STMTON_STMCPULPVDDFTON_M 0x00007C00
#define AM_REG_INFO1_STMTON_STMCPULPVDDFTON(n) (((uint32_t)(n) << 10) & 0x00007C00)
#define AM_REG_INFO1_STMTON_STMCPULPVDDFTON_Pos 10
#define AM_REG_INFO1_STMTON_STMCPULPVDDFTON_Msk 0x00007C00
#define AM_REG_INFO1_STMTON_STMCPUHPVDDCTON_S 5
#define AM_REG_INFO1_STMTON_STMCPUHPVDDCTON_M 0x000003E0
#define AM_REG_INFO1_STMTON_STMCPUHPVDDCTON(n) (((uint32_t)(n) << 5) & 0x000003E0)
#define AM_REG_INFO1_STMTON_STMCPUHPVDDCTON_Pos 5
#define AM_REG_INFO1_STMTON_STMCPUHPVDDCTON_Msk 0x000003E0
#define AM_REG_INFO1_STMTON_STMCPULPVDDCTON_S 0
#define AM_REG_INFO1_STMTON_STMCPULPVDDCTON_M 0x0000001F
#define AM_REG_INFO1_STMTON_STMCPULPVDDCTON(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_INFO1_STMTON_STMCPULPVDDCTON_Pos 0
#define AM_REG_INFO1_STMTON_STMCPULPVDDCTON_Msk 0x0000001F

// DEFAULTTON - Memory LDO configuration fields
#define AM_REG_INFO1_DEFAULTTON_RESVD_S 20
#define AM_REG_INFO1_DEFAULTTON_RESVD_M 0xFFF00000
#define AM_REG_INFO1_DEFAULTTON_RESVD(n) (((uint32_t)(n) << 20) & 0xFFF00000)
#define AM_REG_INFO1_DEFAULTTON_RESVD_Pos 20
#define AM_REG_INFO1_DEFAULTTON_RESVD_Msk 0xFFF00000
#define AM_REG_INFO1_DEFAULTTON_VDDFACTHIGHTON_S 15
#define AM_REG_INFO1_DEFAULTTON_VDDFACTHIGHTON_M 0x000F8000
#define AM_REG_INFO1_DEFAULTTON_VDDFACTHIGHTON(n) (((uint32_t)(n) << 15) & 0x000F8000)
#define AM_REG_INFO1_DEFAULTTON_VDDFACTHIGHTON_Pos 15
#define AM_REG_INFO1_DEFAULTTON_VDDFACTHIGHTON_Msk 0x000F8000
#define AM_REG_INFO1_DEFAULTTON_VDDFACTLOWTON_S 10
#define AM_REG_INFO1_DEFAULTTON_VDDFACTLOWTON_M 0x00007C00
#define AM_REG_INFO1_DEFAULTTON_VDDFACTLOWTON(n) (((uint32_t)(n) << 10) & 0x00007C00)
#define AM_REG_INFO1_DEFAULTTON_VDDFACTLOWTON_Pos 10
#define AM_REG_INFO1_DEFAULTTON_VDDFACTLOWTON_Msk 0x00007C00
#define AM_REG_INFO1_DEFAULTTON_VDDCACTHIGHTON_S 5
#define AM_REG_INFO1_DEFAULTTON_VDDCACTHIGHTON_M 0x000003E0
#define AM_REG_INFO1_DEFAULTTON_VDDCACTHIGHTON(n) (((uint32_t)(n) << 5) & 0x000003E0)
#define AM_REG_INFO1_DEFAULTTON_VDDCACTHIGHTON_Pos 5
#define AM_REG_INFO1_DEFAULTTON_VDDCACTHIGHTON_Msk 0x000003E0
#define AM_REG_INFO1_DEFAULTTON_VDDCACTLOWTON_S 0
#define AM_REG_INFO1_DEFAULTTON_VDDCACTLOWTON_M 0x0000001F
#define AM_REG_INFO1_DEFAULTTON_VDDCACTLOWTON(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_INFO1_DEFAULTTON_VDDCACTLOWTON_Pos 0
#define AM_REG_INFO1_DEFAULTTON_VDDCACTLOWTON_Msk 0x0000001F

// VDDCLVACTTRIMADJ - VDDCLV Active Trim Voltage Trim Adjust
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_RESVD_S 28
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_RESVD_M 0xF0000000
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_RESVD(n) (((uint32_t)(n) << 28) & 0xF0000000)
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_RESVD_Pos 28
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_RESVD_Msk 0xF0000000
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM3_S 21
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM3_M 0x0FE00000
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM3(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM3_Pos 21
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM3_Msk 0x0FE00000
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM2_S 14
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM2_M 0x001FC000
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM2(n) (((uint32_t)(n) << 14) & 0x001FC000)
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM2_Pos 14
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM2_Msk 0x001FC000
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM1_S 7
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM1_M 0x00003F80
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM1(n) (((uint32_t)(n) << 7) & 0x00003F80)
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM1_Pos 7
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM1_Msk 0x00003F80
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM0_S 0
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM0_M 0x0000007F
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM0(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM0_Pos 0
#define AM_REG_INFO1_VDDCLVACTTRIMADJ_TRIM0_Msk 0x0000007F

// POWERSTATE_RSVD_D1 - Power state reserved register
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_RESVD_S 0
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_RESVD_M 0xFFFFFFFF
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_RESVD(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_RESVD_Pos 0
#define AM_REG_INFO1_POWERSTATE_RSVD_D1_RESVD_Msk 0xFFFFFFFF

// POWERSTATE_RSVD_D2 - Power state reserved register
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_RESVD_S 0
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_RESVD_M 0xFFFFFFFF
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_RESVD(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_RESVD_Pos 0
#define AM_REG_INFO1_POWERSTATE_RSVD_D2_RESVD_Msk 0xFFFFFFFF

